app/Controllers/Admin/AdminController.php

SELECT COUNT(*) AS `numrows`
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'paid'
AND `created_at` >= '2025-11-08 00:00:00'
AND `created_at` < '2025-12-08 00:00:00'
SELECT SUM(`total_usd`) AS `sum`
FROM `orders`
WHERE `status` = 'paid'
AND `created_at` >= '2025-11-08 00:00:00'
AND `created_at` < '2025-12-08 00:00:00'
---
    public function index()
    {
        $db = Database::connect();

        // KPIs (basic examples, adjust per your schema)
        $totalProducts = $db->table('products')->countAllResults();
        $totalUsers    = $db->table('users')->countAllResults();

        // Sales aggregates (guard if orders table doesn't exist)
        $tables = array_map('strtolower', $db->listTables());
        // Date range (defaults to last 30 days)
        $startParam = $this->request->getGet('start');
        $endParam   = $this->request->getGet('end');
        $startDate  = ($startParam && preg_match('/^\d{4}-\d{2}-\d{2}$/', $startParam)) ? $startParam : date('Y-m-d', strtotime('-29 days'));
        $endDate    = ($endParam && preg_match('/^\d{4}-\d{2}-\d{2}$/', $endParam)) ? $endParam : date('Y-m-d');
        if (in_array('orders', $tables)) {
            $startDT = $startDate . ' 00:00:00';
            $endDT   = date('Y-m-d 00:00:00', strtotime($endDate . ' +1 day'));

            // KPIs within range and status paid
            $totalOrders = $db->table('orders')
                ->where('status', 'paid')
                ->where('created_at >=', $startDT)
                ->where('created_at <', $endDT)
                ->countAllResults();

            $sumRevenueRow = $db->table('orders')
                ->selectSum('total_usd', 'sum')
                ->where('status', 'paid')
                ->where('created_at >=', $startDT)
                ->where('created_at <', $endDT)
                ->get()->getRow('sum');

SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `user_id`
FROM `orders`
WHERE `status` = 'paid'
AND `created_at` >= '2025-11-08 00:00:00'
AND `created_at` < '2025-12-08 00:00:00'
) CI_count_all_results
---

            $avgOrder = $totalOrders > 0 ? ($sumRevenue / $totalOrders) : 0.0;

            $activeCustomers = $db->table('orders')
                ->select('user_id')
                ->distinct()
                ->where('status', 'paid')
                ->where('created_at >=', $startDT)
                ->where('created_at <', $endDT)
                ->countAllResults();

SELECT DATE(created_at) as d, COUNT(*) as c, SUM(total_usd) as s
FROM `orders`
WHERE `status` = 'paid'
AND `created_at` >= '2025-11-08 00:00:00'
AND `created_at` < '2025-12-08 00:00:00'
GROUP BY DATE(created_at)
ORDER BY DATE(created_at) ASC
---
            $ordersSeries = [];
            $revenueSeries = [];

            $agg = $db->table('orders')
                ->select("DATE(created_at) as d, COUNT(*) as c, SUM(total_usd) as s", false)
                ->where('status', 'paid')
                ->where('created_at >=', $startDT)
                ->where('created_at <', $endDT)
                ->groupBy('DATE(created_at)', false)
                ->orderBy('DATE(created_at)', 'ASC', false)
                ->get()->getResultArray();

SELECT p.name as product, SUM(oi.quantity) as qty, SUM(oi.price_usd * oi.quantity) as revenue
FROM `order_items` `oi`
JOIN `orders` `o` ON `o`.`id` = `oi`.`order_id`
LEFT JOIN `products` `p` ON `p`.`id` = `oi`.`product_id`
WHERE `o`.`status` = 'paid'
AND `o`.`created_at` >= '2025-11-08 00:00:00'
AND `o`.`created_at` < '2025-12-08 00:00:00'
GROUP BY `oi`.`product_id`
ORDER BY `qty` DESC
 LIMIT 5
SELECT `id`, `user_id`, `total_usd`, `status`, `created_at`
FROM `orders`
WHERE `status` = 'paid'
AND `created_at` >= '2025-11-08 00:00:00'
AND `created_at` < '2025-12-08 00:00:00'
ORDER BY `created_at` DESC
 LIMIT 10
---
            }

            // Top products and recent orders
            $topProducts = $db->table('order_items oi')
                ->select('p.name as product, SUM(oi.quantity) as qty, SUM(oi.price_usd * oi.quantity) as revenue', false)
                ->join('orders o', 'o.id = oi.order_id')
                ->join('products p', 'p.id = oi.product_id', 'left')
                ->where('o.status', 'paid')
                ->where('o.created_at >=', $startDT)
                ->where('o.created_at <', $endDT)
                ->groupBy('oi.product_id')
                ->orderBy('qty', 'DESC')
                ->limit(5)
                ->get()->getResultArray();

            $recentOrders = $db->table('orders')
                ->select('id, user_id, total_usd, status, created_at')
                ->where('status', 'paid')
                ->where('created_at >=', $startDT)
                ->where('created_at <', $endDT)
                ->orderBy('created_at', 'DESC')
                ->limit(10)
                ->get()->getResultArray();