app/Controllers/Admin/EmployeesController.php

    public function index()
    {
        $model = new EmployeeModel();
        $employees = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `employees`
ORDER BY `created_at` DESC