app/Controllers/Admin/ProductsController.php

    public function index()
    {
        $model = new ProductModel();
        $products = $model->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `products`
ORDER BY `created_at` DESC