app/Controllers/CartController.php

DELETE FROM `cart_items`
WHERE `id` = '1'
---
    public function remove($id)
    {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $db = \Config\Database::connect();
        $builder = $db->table('cart_items');
        $builder->where('id', $id)->delete();