app/Controllers/CheckoutController.php

    public function index()
    {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $db = Database::connect();
        $userId = session()->get('id');

        $builder = $db->table('cart_items');
        $builder->select('cart_items.*, products.name, products.price_usd');
        $builder->join('products', 'products.id = cart_items.product_id');
        $builder->where('user_id', $userId);
        $items = $builder->get()->getResultArray();
---
SELECT `cart_items`.*, `products`.`name`, `products`.`price_usd`
FROM `cart_items`
JOIN `products` ON `products`.`id` = `cart_items`.`product_id`
WHERE `user_id` = '4'

    public function place()
    {
        if (!session()->get('isLoggedIn')) return redirect()->to('/login');

        $db = Database::connect();
        $userId = session()->get('id');

        // fetch cart
        $builder = $db->table('cart_items');
        $builder->select('cart_items.*, products.name, products.price_usd');
        $builder->join('products', 'products.id = cart_items.product_id');
        $builder->where('user_id', $userId);
        $items = $builder->get()->getResultArray();
---
SELECT `cart_items`.*, `products`.`name`, `products`.`price_usd`
FROM `cart_items`
JOIN `products` ON `products`.`id` = `cart_items`.`product_id`
WHERE `user_id` = '4'


        // insert order
        $orders = $db->table('orders');
        $orders->insert([
            'user_id' => $userId,
            'total_usd' => $totalUSD,
            'status' => 'paid',
            'created_at' => date('Y-m-d H:i:s'),
        ]);
---
INSERT INTO `orders` (`user_id`, `total_usd`, `status`, `created_at`) VALUES ('4', 224, 'paid', '2025-12-07 09:34:53')

        // insert order_items
        $orderItems = $db->table('order_items');
        foreach ($items as $it) {
            $orderItems->insert([
                'order_id' => $orderId,
                'product_id' => $it['product_id'],
                'price_usd' => $it['price_usd'],
                'quantity' => $it['quantity'],
            ]);
        }

        // clear cart
        $db->table('cart_items')->where('user_id', $userId)->delete();
---
INSERT INTO `order_items` (`order_id`, `product_id`, `price_usd`, `quantity`) VALUES (2, '4', '25.00', '1')
DELETE FROM `cart_items`
WHERE `user_id` = '4'