app/Controllers/ProductController.php

    public function index()
    {
        $model = new ProductModel();
        $session = session();

        // --- UPDATED CURRENCY LOGIC ---
        // 1. If URL has currency, update session.
        if ($this->request->getVar('currency')) {
            $currency = $this->request->getVar('currency');
            $session->set('currency', $currency);
        } else {
            // 2. Else get from session or default
            $currency = $session->get('currency') ?? 'USD';
        }
        // ------------------------------

        $products = $model->findAll();
---
SELECT *
FROM `products`